// написать программу которая генерирует два целых ыисла и выводитих сумму

Console.Clear();
int numberA = 24;
int numberB = 42;
int result = numberA + numberB;
Console.WriteLine(result);

